{
    "country": "Hamburg, Germany",
    "featured": true,
    "companyLogo": "/images/logos/firebase.png",
    "bio": "As a senior developer advocate on the Firebase team at Google, Peter Friese is dedicated to helping developers build amazing experiences and high-quality apps using Firebase on iOS, Android, and the web. With a passion for empowering developers and fostering innovation, Peter works tirelessly with the Firebase team to make his vision of \"cutting short the time to magic\" a reality. Peter is also the author of the book Asynchronous Programming with SwiftUI and Combine: Functional Programming to Build UIs on Apple Platforms and host of the YouTube show Better Safe than Sorry, which explores best practices for building secure apps. He has written code in BASIC, C, ObjectPascal, Java, Kotlin, Xtext, JavaScript, TypeScript, Objective-C, and a number of home-grown DSLs - but his all-time favourite is Swift.",
    "photo": "https://firebasestorage.googleapis.com/v0/b/devfest-hamburg.appspot.com/o/23%2Fspeakers%2FPeter_Friese.png?alt=media&token=74afbcd8-fe97-4bc2-a0d4-1d56dd9199e4",
    "title": "Developer Advocate",
    "photoUrl": "https://firebasestorage.googleapis.com/v0/b/devfest-hamburg.appspot.com/o/23%2Fspeakers%2FPeter_Friese.png?alt=media&token=74afbcd8-fe97-4bc2-a0d4-1d56dd9199e4",
    "companyLogoUrl": "/images/logos/firebase.png",
    "name": "Peter Friese",
    "shortBio": "As a senior developer advocate on the Firebase team at Google, Peter Friese is dedicated to helping developers build amazing experiences and high-quality apps using Firebase on iOS, Android, and the web.",
    "company": "Firebase",
    "pronouns": "he/him",
    "socials": [
        {
            "icon": "linkedin",
            "link": "https://www.linkedin.com/in/peterfriese",
            "name": "LinkedIn"
        },{
            "icon": "twitter",
            "link": "https://twitter.com/peterfriese",
            "name": "Twitter"
        },{
            "icon": "website",
            "link": "https://peterfriese.dev",
            "name": "Website"
        },{
            "icon": "website",
            "link": "https://peterfriese.dev/books",
            "name": "Website"
        }
    ],
    "order": 0
  }